<template>
  <div>
    <div style="text-align: center">
      <h3>枝网查重平台用户协议</h3>
    </div>
    <div style="margin: 5px">
      <p>
        欢迎您使用枝网查重平台服务（以下简称“本服务”）！
        《枝网查重平台用户协议》（以下简称“本协议”）为您（以下称“用户”）与开发者就使用本服务所达成的协议。使用本服务即表示您已审慎阅读、充分理解并同意遵守本协议下全部条款，特别是免除或者限制责任的条款。
      </p>

      <h3>一、定义及解释</h3>

      <ol>
        <li>用户：指符合本协议规定的条件，使用本服务的单位或个人。</li>
        <li>
          枝网查重平台：开发者为有小作文查重需求的用户提供的查重平台。枝网查重平台以Apache-2.0许可证开源于<a
            href="https://github.com/stream2000/ASoulCnki"
            target="_blank"
            >ASoulCnki</a
          >
        </li>
        <li>
          枝网查重服务：指开发者按照本协议约定通过该枝网查重平台向用户提供的小作文查重服务。
        </li>
      </ol>

      <h3>二、论文查重服务的内容</h3>

      <ol>
        <li>
          用户通过枝网查重平台的相关页面，向开发者提交委托小作文查重服务请求。
        </li>
        <li>
          用户提交查重内容：用户通过枝网查重平台相关页面向开发者上传需要进行查重的小作文。
        </li>
      </ol>

      <h3>三、双方权利义务</h3>

      <ol>
        <li>
          用户在使用本服务时，不得故意或者过失的损害本平台的合法权益，不得利用本查重平台直接或者间接的从事违反所在国家、地区的法律以及社会公德的行为。
        </li>
        <li>
          本查重平台的检测报告仅仅是基于大数据技术自动生成，检测结果仅供参考之用，不作为正式依据，由此引起的相关问题开发者不承担任何责任。
        </li>
        <li>由于程序算法以及对比库的更新，检测报告可能会存在差异。</li>
        <li>
          开发者尊重作者知识产权，用户上传小作文进行检测时，开发者不对原文的合法性、真实性以及是否侵权承担任何形式的责任，因原文内容引起的一切纠纷由用户全部承担。
        </li>
        <li>
          用来进行检测的数据全部来自互联网公开数据，由数据版权引起的问题，开发者不承担任何责任。
        </li>
        <li>
          若因硬件故障或其它不可抗力而导致暂停服务或其他问题，于暂停服务期间造成的一切不便与损失，开发者不承担任何责任。
          由于查重系统的调整导致信息丢失和/或其他结果的，开发者不承担任何责任。因系统维护或升级等而需暂停服务时，开发者将事先公告。
        </li>
      </ol>

      <h3>四、隐私保护</h3>

      <ol>
        <li>开发者不会主动获取和存储用户的隐私信息。</li>
      </ol>

      <h3>五、协议的生效、修改和解释</h3>

      <ol>
        <li>本协议一经公布即生效。</li>
        <li>
          开发者有权随时根据法律、法规及规范性文件的变化以及互联网的发展情况，不断修改和完善本协议内容，修改后的协议公布于查重平台网站上。如果不同意开发者对本协议相关条款所做的修改，用户有权停止使用查重服务。如果用户继续使用查重服务，则视为用户接受开发者对本协议相关条款所做的修改。
        </li>
      </ol>
    </div>
    <div style="text-align: center">
      <h3>开源协议</h3>
      <svg
        height="32"
        class="octicon octicon-law color-text-primary float-left mr-2"
        viewBox="0 0 24 24"
        version="1.1"
        width="32"
        aria-hidden="true"
      >
        <path
          fill-rule="evenodd"
          d="M12.75 2.75a.75.75 0 00-1.5 0V4.5H9.276a1.75 1.75 0 00-.985.303L6.596 5.957A.25.25 0 016.455 6H2.353a.75.75 0 100 1.5H3.93L.563 15.18a.762.762 0 00.21.88c.08.064.161.125.309.221.186.121.452.278.792.433.68.311 1.662.62 2.876.62a6.919 6.919 0 002.876-.62c.34-.155.606-.312.792-.433.15-.097.23-.158.31-.223a.75.75 0 00.209-.878L5.569 7.5h.886c.351 0 .694-.106.984-.303l1.696-1.154A.25.25 0 019.275 6h1.975v14.5H6.763a.75.75 0 000 1.5h10.474a.75.75 0 000-1.5H12.75V6h1.974c.05 0 .1.015.14.043l1.697 1.154c.29.197.633.303.984.303h.886l-3.368 7.68a.75.75 0 00.23.896c.012.009 0 0 .002 0a3.154 3.154 0 00.31.206c.185.112.45.256.79.4a7.343 7.343 0 002.855.568 7.343 7.343 0 002.856-.569c.338-.143.604-.287.79-.399a3.5 3.5 0 00.31-.206.75.75 0 00.23-.896L20.07 7.5h1.578a.75.75 0 000-1.5h-4.102a.25.25 0 01-.14-.043l-1.697-1.154a1.75 1.75 0 00-.984-.303H12.75V2.75zM2.193 15.198a5.418 5.418 0 002.557.635 5.418 5.418 0 002.557-.635L4.75 9.368l-2.557 5.83zm14.51-.024c.082.04.174.083.275.126.53.223 1.305.45 2.272.45a5.846 5.846 0 002.547-.576L19.25 9.367l-2.547 5.807z"
        ></path>
      </svg>
      <p>Apache License 2.0</p>
    </div>
  </div>
</template>

<script>
export default {
  created() {
    document.title = "《枝网查重平台用户协议》";
  },
};
</script>

<style>
body {
  background: #fafafa;
}
h3 {
  margin: 18px 0;
  font-size: 16px;
  font-weight: 700;
}
</style>